---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.GutterType
source: html/49559940-78dd-e9e2-0af8-ac3b10cce737.htm
---
# GutterType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.